---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalGridCellSize
source: html/230702f7-ccf6-3c1d-b9a4-cb1b38c65f50.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalGridCellSize Property

The cell size for the uniform cubical grid used when computing the building envelope

## Syntax (C#)
```csharp
public double AnalyticalGridCellSize { get; set; }
```

## Remarks
This is the size of the "cubes" used to divide the building shell
 bounding box into a uniform cubical 3D grid.